Repository: teknogods/TeknoParrotUI
Catalog: TeknoParrotUi/Properties/Resources-*.resx
Languages: fi_fi

# AboutCredits
source: By TeknoGods
fi_fi: Tekijät TeknoGods

source: Add Game
fi_fi: Lisää Peli

source: Back
fi_fi: Takaisin

source: Cancel
fi_fi: Peruuta

source: Delete Game
fi_fi: Poista Peli

# DownloaderCancelled
source: Download Cancelled
fi_fi: Lataus Peruttu

# DownloaderComplete
source: Download Complete
fi_fi: Lataus Valmis

# DownloaderDownloading
source: Downloading
fi_fi: Ladataan

# DownloaderError
source: Error Downloading
fi_fi: Lataus Virhe

source: Error
fi_fi: Virhe

# ErrorAllowedRange
source: Allowed range is 0-8191!
fi_fi: Sallittu arvon väli on 0-8191!

# ErrorAlreadyRunning
source: TeknoParrotUI seems to already be running, want to close it?
fi_fi: TeknoParrotUI näyttää olevan jo käynnissä, haluatko sulkea sen?

# ErrorCannotParseGUID
source: Cannot parse GUID: {0}. Please check that data has the GUID value only and nothing else!
fi_fi: En voi parsia GUID arvoa: {0}. Tarkista että data on vain numeroita.

# ErrorCantLoadParrotData
source: Exception happened during loading ParrotData.xml! Generate new one by saving! {0}
fi_fi: Virhe ladattaessa ParrotData.xml tiedostoa! Tee uusi tallentamalla asetukset. {0}

# ErrorCantLoadProfile
source: Error loading {0}, Would you to delete it?
fi_fi: Virhe ladattaessa {0}, poistetaanko tiedosto?

# ErrorCantSaveParrotData
source: Exception happened during ParrotData.xml saving! {0}
fi_fi: Virhe tallentaessa ParrotData.xml tiedostoa: {0}

# ErrorGamePathNotSet
source: Game location not set! Please set it in Game Settings.
fi_fi: Pelin käynnistystiedostoa ei ole asetettu! Aseta se Peli Asetuksista.

# ErrorMasterServerOffline
source: Master server is offline.
fi_fi: Keskuspalvelin ei vastaa.

# ErrorOldTeknoParrotDirectory
source: Seems you have extracted me to the directory of old TeknoParrot. Please extract me to a new directory instead!
fi_fi: Näyttää siltä että purit minut erittäin vanhan TeknoParrotin kansioon, ole hyvä ja pura minut uuteen kansioon.

# FirstRun
source: Seems like this is first time you are running TeknoParrotUi, please set emulation settings.
fi_fi: Näyttää siltä että käynnistit minut ensimmäistä kertaa, muista asettaa kaikki asetukset ja tallentaa ne.

# GameList
source: Games:
fi_fi: Pelit:

source: Game Running
fi_fi: Peli Käynnissä

# GameRunningCheckTaskMgr
source: Since you force closed the emulator, you should check Task Manager for any processes still running that are related to the emulator or your game.
fi_fi: Koska suljit emulaattorin väkisin, suosittelen että tarkistat tehtävienhallinnasta että mitään prosesseja ei jäänyt päälle.

# GameRunningForceQuit
source: Force Quit Game
fi_fi: Pakota Pelin Sulkeminen

# GameRunningGameStopped
source: Game Stopped
fi_fi: Peli Pysäytetty

# GameSettingsGameExecutable
source: Game Executable:
fi_fi: Pelin käynnistystiedosto:

# GameSettingsGameExecutableFilter
source: Game executable
fi_fi: Pelin käynnistystiedosto

# GameSettingsSelectGameExecutable
source: Please select game executable
fi_fi: Valitse pelin käynnistys tiedosto

source: Information
fi_fi: Tietoja

# Library64bit
source: This game is 64-bit and cannot run on a 32-bit OS.
fi_fi: Pahoittelut. Tämä peli vaatii 64 bittisen käyttöjärjestelmän, sinulla näyttää olevan vain 32 bittinen.

# LibraryAnotherEmulator
source: It seems you have other emulator already in use. Please remove the following files from the game directory:
fi_fi: Sinulla näyttää olevan jo toinen emulaattori käytössä.

# LibraryBadiDMAC
source: Please update OpenParrot! You seem to be using an unofficial {0} file! The game may crash or be unstable. Continue?
fi_fi: Ole hyvä ja päivitä OpenParrot! Näyttää siltä että tämä ei ole virallinen {0} tiedosto! Peli saattaa kaatua tai olla epävakaa. Haluatko jatkaa?

# LibraryCantFindGame
source: Cannot find game exe at: {0}
fi_fi: En löydä käynnistystiedostoa: {0}

# LibraryCantFindLoader
source: Cannot find {0}! It is probably removed by your anti-virus software. Please re-extract TeknoParrot.
fi_fi: En löydä kirjastotiedostoa {0}!Pura TeknoParrot uudestaan.

# LibraryControllerSetup
source: CONTROLLER SETUP
fi_fi: OHJAIN ASETUKSET

# LibraryDownloadAllIcons
source: This will download every missing icon for TeknoParrot. The file is around 50 megabytes. Are you sure you want to continue?
fi_fi: Tämä lataa kaikki esikatselukuvat peleille, oletko varma että haluat ladata ne? Ladattava tiedosto on noin 50 megaa.

# LibraryDownloadMissingIcons
source: DOWNLOAD MISSING ICONS
fi_fi: LATAA PUUTTUVAT ESIKATSELUKUVAT

# LibraryEmulator
source: Emulator
fi_fi: Emulaattori

# LibraryGameLocationNotSet
source: Game location not set! Please set it in Game Settings.
fi_fi: Pelin sijaintia ei ole asetettu, ole hyvä ja aseta se peli asetuksista.

# LibraryGameSettings
source: GAME SETTINGS
fi_fi: PELI ASETUKSET

# LibraryInvalidFiles
source: There are possibly some invalid files in your game directory. The following files may need to be removed from the game directory, unless you know what they are:
fi_fi: Pelisi kansiossa on mahdollisesti viallisia tiedostoa. Seuraavanlaiset tiedostot tulisi poistaa kansiosta ennen pelin pelaamista:

# LibraryInvalidFilesContinue
source: Click Yes to continue running the game as is.
fi_fi: Paina kyllä jos haluat käynnistää pelin joka tapauksessa.

# LibraryLaunchGame
source: LAUNCH GAME
fi_fi: KÄYNNISTÄ PELI

# LibraryMoreInfo
source: OPEN WIKI
fi_fi: LISÄTIETOJA

# LibraryNeedsAdmin
source: Seems like you are not running TeknoParrotUI as Administrator! The game {0} requires the UI to be running as Administrator to function properly. Continue anyway WITHOUT admin rights? This might cause issues or crashes.
fi_fi: Näyttää siltä ettei minulla ole Administrator oikeuksia. Peli {0] vaatii että minulla on nämä oikeudet tai se ei toimi oikein. Haluatko jatkaa silti?

# LibraryNoGames
source: You have no games set up. Do you want to add one now?
fi_fi: Et ole lisännyt vielä yhtään peliä, haluatko lisätä niitä nyt?

# LibraryNoHashes
source: It appears that you are trying to verify a game that doesn't have a clean file hash list yet.
fi_fi: Koitat tarkistaa pelin eheyttä mutta pelillä ei ole vielä eheystiedostoa.

# LibraryNoInfo
source: No Game Information Available
fi_fi: Pelistä ei ole lisätietoja saatavilla.

# LibraryTestMenu
source: Test Menu
fi_fi: Testiruutu

# LibraryToggleTestMode
source: Toggle test mode.
fi_fi: Käynnistä testiruutuun.

# LibraryVerifyGame
source: VERIFY GAME
fi_fi: TARKISTA PELIN EHEYS

# MainAbout
source: About
fi_fi: Tietoja

# MainAreYouSure
source: Are you sure?
fi_fi: Oletko varma?

# MainLibrary
source: Library
fi_fi: Kirjasto

# MainQuit
source: Quit
fi_fi: Lopeta ohjelma

# MainRomScanner
source: Rom Scanner
fi_fi: Skannaa ROMeja

# MainSettings
source: Settings
fi_fi: Asetukset

# MainTPOnline
source: TP Online (OLD)
fi_fi: TeknoParrot Online

source: No
fi_fi: Ei

# PatreonBecomeAPatron
source: Become A Subscriber!
fi_fi: Auta projektia pienellä summalla ja saa uskomattomia etuja!

# PatreonDeregisterKey
source: DeRegister Key
fi_fi: Deaktivoi avain

# PatreonError
source: Error from other process:
fi_fi: Virhe toisesta prosessista:

# PatreonMissingBudgie
source: This feature requires TeknoParrot Core, please install it.
fi_fi: Tämä ominaisuus vaatii TeknoParrot Core:n.

# PatreonMustNotBeBlank
source: Subscription key must not be blank
fi_fi: Avain ei kyllä näytä tältä.

# PatreonRegisterKey
source: Register Key
fi_fi: Rekisteröi avain

# PatreonStatus
source: Status:
fi_fi: Tila:

# SettingsCheckForUpdates
source: Check for updates on launch
fi_fi: Tarkista päivitykset käynnistäessä.

# SettingsConfirmExit
source: Confirmation prompt on exit
fi_fi: Näytä "oletko varma" dialogi suljettaessa.

# SettingsDInputWheel
source: Direct Input Wheel Settings
fi_fi: Direct Input Ratti Asetukset

# SettingsDownloadFFB
source: Download Force Feedback Plugin
fi_fi: Lataa Force Feedback lisäosa (Ohjain/Ratti tärinät)

# SettingsDownloadIcon
source: Download game icon when selected
fi_fi: Lataa pelin esikatselukuva kun valitset pelin listasta.

# SettingsHardwareAccel
source: Disable Hardware Acceleration in UI
fi_fi: Käyttöliittymän rautakiihdytys pois päältä

# SettingsHideConsoleWindows
source: Hide console windows
fi_fi: Piilota konsoli ikkunat

# SettingsJoystickGunSettings
source: Joystick Gun Settings
fi_fi: Aseen ohjain asetukset

# SettingsLoadLastPlayed
source: Load last game played on launch
fi_fi: Muista edellinen peli uudelleen käynnistäessä.

# SettingsP1GunJoystickSensitivity
source: Player 1 Gun Joystick Sensitivity
fi_fi: Player 1 Aseen Herkkyys Ohjaimella

# SettingsP2GunJoystickSensitivity
source: Player 2 Gun Joystick Sensitivity
fi_fi: Player 2 Aseen Herkkyys Ohjaimella

# SettingsSaveSettings
source: Save settings
fi_fi: Tallenna asetukset

# SettingsShowGameOnDiscord
source: Show current game playing on Discord
fi_fi: Näytä discordissa että pelaat TeknoParrotilla.

# SettingsSto0zZone
source: Enable sTo0z Zone
fi_fi: Kytke päälle sto0z alue.

# SettingsUIColour
source: Title colour
fi_fi: Väri

# SettingsUICustomization
source: UI Customization (Patreon)
fi_fi: Ulkoasun Muokkaus (Tukijoille)

# SettingsUIDarkMode
source: Dark Mode
fi_fi: Pimeä tila

# SettingsUIHolidayThemes
source: Use a different theme on holidays
fi_fi: Ota automaattisesti käyttöön lomakausien ulkoasuteemat.

# SuccessfullySaved
source: Successfully saved {0}!
fi_fi: Onnistuneesti tallennettu {0}!

# TPOCreateLobby
source: Create Lobby and Launch Game
fi_fi: Luo Aula Ja Käynnistä Peli

# TPOFilter
source: Filter by game:
fi_fi: Suodata peli:

# TPOGame
source: Game
fi_fi: Peli

# TPOJoinLobby
source: Join Lobby and Launch Game
fi_fi: Liity Aulaan Ja Käynnistä Peli

# TPOLobbyName
source: Lobby Name
fi_fi: Aulan nimi

# TPOPlayers
source: Players
fi_fi: Pelaajat

# TPORefresh
source: Refresh Lobbies
fi_fi: Päivitä aulat

# UpdaterAvailable
source: There is a new update available.
fi_fi: Uusi päivitys on ladattavissa.

# UpdaterNotInstalled
source: Not Installed
fi_fi: Ei Asennettu

# UpdaterOpenChangelog
source: Open Changelog
fi_fi: Näytä muutokset

# UpdaterRestart
source: Would you like TeknoParrotUi to restart to finish the update? Otherwise, TeknoParrotUi will close.
fi_fi: Käynnistetäänkö TeknoParrotUi uudestaan päivityksen jälkeen? Muussa tapauksessa se suljetaan.

# UpdaterSuccess
source: Sucessfully updated {0} to {1}
fi_fi: Onnistuneesti päivitettiin {0} versioon {1}

# UpdaterUpdate
source: Update
fi_fi: Päivitä

# VerifyCancelled
source: Verification Cancelled.
fi_fi: Eheyden Tarkastaminen Peruutettu.

# VerifyChecking
source: Verifying Game Integrity...
fi_fi: Tarkistetaan Pelin Eheyttä...

# VerifyFilesInvalid
source: Game files invalid
fi_fi: Poikkeavat pelitiedostot

# VerifyFilesValid
source: Game files valid
fi_fi: Eheät pelitiedostot

# VerifyInvalid
source: Invalid:
fi_fi: Poikkeava:

# VerifyValid
source: Valid:
fi_fi: Eheä:

source: Warning
fi_fi: Varoitus

source: Yes
fi_fi: Kyllä
